app/Http/Controllers/AnswersController.php

    public function update(Request $request, Question $question, Answer $answer)
    {
        $this->authorize('update', $answer);
        $answer->update($request->validate([
            'body' => 'required'
        ]));
---
update `answers` set `body` = 'This is my updated answer', `answers`.`updated_at` = '2020-03-11 01:16:30' where `id` = 27