app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (2, 3)
select count(*) as aggregate from `questions`
---
    public function index()
    {
        $questions = Question::with('user')->latest()->paginate(5);

update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-03-10 15:51:13' where `id` = 8
---
    public function show(Question $question)
    {
        $question->increment('views');