app/Providers/RouteServiceProvider.php

    public function boot()
    {
        Route::bind('slug', function($slug){
            return $question = Question::with('answers.user')->where('slug', $slug)->first() ?? abort(404);
---
select * from `answers` where `answers`.`question_id` in (8)
select * from `questions` where `slug` = 'non-nihil-esse-esse-dolorem' limit 1
select * from `users` where `users`.`id` in (1, 4)